<html xmlns:ng="http://docbook.org/docbook-ng"><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1082; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091; Asteroids</title><meta name="generator" content="DocBook XSL Stylesheets V1.79.2"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="article"><div class="titlepage"><div><div><h1 class="title"><a name="d5e1"></a>&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1082; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091; Asteroids</h1></div><div><div class="author"><h3 class="author"><span class="orgname">&#1053;&#1080;&#1082;&#1086;&#1083;&#1072;&#1081; &#1041;&#1077;&#1079;&#1076;&#1077;&#1090;&#1085;&#1099;&#1081;</span></h3></div></div></div><hr></div><div class="toc"><p><b>Table of Contents</b></p><dl class="toc"><dt><span class="section"><a href="#d5e6">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</a></span></dt><dd><dl><dt><span class="section"><a href="#d5e8">&#1053;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;</a></span></dt></dl></dd><dt><span class="section"><a href="#d5e13">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1080;&#1075;&#1088;&#1099;</a></span></dt><dd><dl><dt><span class="section"><a href="#d5e15">&#1054;&#1073; &#1080;&#1075;&#1088;&#1077;</a></span></dt><dt><span class="section"><a href="#d5e18">&#1055;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087; &#1080;&#1075;&#1088;&#1099;</a></span></dt></dl></dd><dt><span class="section"><a href="#d5e21">&#1048;&#1083;&#1083;&#1102;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080;</a></span></dt><dt><span class="section"><a href="#d5e38">&#1044;&#1077;&#1090;&#1072;&#1083;&#1080; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;</a></span></dt><dd><dl><dt><span class="section"><a href="#d5e41">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1082;&#1086;&#1088;&#1072;&#1073;&#1083;&#1103;</a></span></dt><dt><span class="section"><a href="#d5e45">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1072;&#1089;&#1090;&#1077;&#1088;&#1086;&#1080;&#1076;&#1072;</a></span></dt><dt><span class="section"><a href="#d5e49">&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1083;&#1072;&#1079;&#1077;&#1088;&#1072;</a></span></dt></dl></dd></dl></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e6"></a>&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</h2></div></div></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e8"></a>&#1053;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;</h3></div></div></div><p>&#1040;&#1089;&#1090;&#1077;&#1088;&#1086;&#1080;&#1076;&#1099; &#8212; &#1101;&#1090;&#1086; &#1085;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103;, &#1080;&#1083;&#1080; &#1088;&#1077;&#1090;&#1088;&#1086; &#1080;&#1075;&#1088;&#1072;, &#8212; &#1101;&#1090;&#1086; &#1087;&#1088;&#1072;&#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100; &#1082;&#1086;&#1089;&#1084;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; 
                &#1089;&#1090;&#1088;&#1077;&#1083;&#1103;&#1083;&#1086;&#1082;. &#1048;&#1075;&#1088;&#1072; Asteroids &#1074;&#1099;&#1087;&#1091;&#1097;&#1077;&#1085;&#1072; &#1074; 1979 &#1075;&#1086;&#1076;&#1091; &#1076;&#1083;&#1103; Atari &#1080; &#1073;&#1099;&#1083;&#1072; &#1089;&#1072;&#1084;&#1086;&#1081; &#1087;&#1088;&#1086;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1086;&#1081; 
                &#1080;&#1075;&#1088;&#1086;&#1081; &#1089;&#1074;&#1086;&#1077;&#1081; &#1101;&#1087;&#1086;&#1093;&#1080;.
        </p><p>&#1048;&#1075;&#1088;&#1072; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1086;&#1085;&#1083;&#1072;&#1081;&#1085; &#1087;&#1086; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081; <a class="link" href="https://azonos712.github.io/index.html" target="_top">
            &#1089;&#1089;&#1099;&#1083;&#1082;&#1077;</a>.</p></div></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e13"></a>&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1080;&#1075;&#1088;&#1099;</h2></div></div></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e15"></a>&#1054;&#1073; &#1080;&#1075;&#1088;&#1077;</h3></div></div></div><p>Asteroids (&#1088;&#1091;&#1089;. &#1040;&#1089;&#1090;&#1077;&#1088;&#1086;&#1080;&#1076;&#1099;) &#8212; &#1080;&#1075;&#1088;&#1072; &#1085;&#1072; &#1072;&#1088;&#1082;&#1072;&#1076;&#1085;&#1099;&#1093; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1072;&#1093;, &#1074;&#1099;&#1087;&#1091;&#1097;&#1077;&#1085;&#1085;&#1072;&#1103; Atari &#1074; 1979 &#1075;&#1086;&#1076;&#1091;.
                &#1057;&#1090;&#1072;&#1083;&#1072; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1079; &#1089;&#1072;&#1084;&#1099;&#1093; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1093; &#1080;&#1075;&#1088; &#1079;&#1086;&#1083;&#1086;&#1090;&#1086;&#1075;&#1086; &#1074;&#1077;&#1082;&#1072; &#1072;&#1088;&#1082;&#1072;&#1076;&#1085;&#1099;&#1093; &#1080;&#1075;&#1088;. 
            </p></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e18"></a>&#1055;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087; &#1080;&#1075;&#1088;&#1099;</h3></div></div></div><p>&#1062;&#1077;&#1083;&#1100; &#1080;&#1075;&#1088;&#1099; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1082;&#1072;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1086;&#1095;&#1082;&#1086;&#1074;, &#1088;&#1072;&#1089;&#1089;&#1090;&#1088;&#1077;&#1083;&#1080;&#1074;&#1072;&#1103; 
            &#1072;&#1089;&#1090;&#1077;&#1088;&#1086;&#1080;&#1076;&#1099; &#1080;&#1083;&#1080; &#1083;&#1077;&#1090;&#1072;&#1102;&#1097;&#1080;&#1077; &#1090;&#1072;&#1088;&#1077;&#1083;&#1082;&#1080; &#1080; &#1080;&#1079;&#1073;&#1077;&#1075;&#1072;&#1103; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1089;&#1090;&#1086;&#1083;&#1082;&#1085;&#1086;&#1074;&#1077;&#1085;&#1080;&#1103; &#1089; &#1086;&#1073;&#1083;&#1086;&#1084;&#1082;&#1072;&#1084;&#1080;. 
            &#1048;&#1075;&#1088;&#1086;&#1082; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1082;&#1086;&#1089;&#1084;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1082;&#1086;&#1088;&#1072;&#1073;&#1083;&#1105;&#1084; &#1074; &#1092;&#1086;&#1088;&#1084;&#1077; &#1089;&#1090;&#1088;&#1077;&#1083;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1082;&#1088;&#1091;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; 
            &#1074;&#1083;&#1077;&#1074;&#1086; &#1080; &#1074;&#1087;&#1088;&#1072;&#1074;&#1086;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1074;&#1080;&#1075;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080; &#1089;&#1090;&#1088;&#1077;&#1083;&#1103;&#1090;&#1100;, &#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1087;&#1077;&#1088;&#1105;&#1076;. &#1055;&#1088;&#1080; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1080; 
            &#1080;&#1084;&#1087;&#1091;&#1083;&#1100;&#1089; &#1085;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103;: &#1077;&#1089;&#1083;&#1080; &#1085;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; &#1076;&#1074;&#1080;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;, &#1090;&#1086; &#1082;&#1086;&#1088;&#1072;&#1073;&#1083;&#1100; &#1087;&#1086;&#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1085;&#1086; &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103;.
            
            &#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1072;&#1089;&#1090;&#1077;&#1088;&#1086;&#1080;&#1076;&#1086;&#1074;, 
            &#1076;&#1088;&#1077;&#1081;&#1092;&#1091;&#1102;&#1097;&#1080;&#1093; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1099;&#1093; &#1090;&#1086;&#1095;&#1082;&#1072;&#1093; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072;. &#1050;&#1088;&#1072;&#1103; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072; &#1079;&#1072;&#1074;&#1105;&#1088;&#1085;&#1091;&#1090;&#1099; &#1076;&#1088;&#1091;&#1075; &#1082; &#1076;&#1088;&#1091;&#1075;&#1091;, 
            &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1072;&#1089;&#1090;&#1077;&#1088;&#1086;&#1080;&#1076;, &#1091;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1081; &#1079;&#1072; &#1074;&#1077;&#1088;&#1093;&#1085;&#1080;&#1081; &#1082;&#1088;&#1072;&#1081; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072;, &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1085;&#1080;&#1078;&#1085;&#1077;&#1084; &#1080; 
            &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1077;&#1090; &#1076;&#1074;&#1080;&#1075;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084; &#1078;&#1077; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080;. &#1050;&#1086;&#1075;&#1076;&#1072; &#1080;&#1075;&#1088;&#1086;&#1082; &#1087;&#1086;&#1087;&#1072;&#1076;&#1072;&#1077;&#1090; &#1074; &#1072;&#1089;&#1090;&#1077;&#1088;&#1086;&#1080;&#1076;, 
            &#1086;&#1085; &#1088;&#1072;&#1079;&#1073;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1086;&#1073;&#1083;&#1086;&#1084;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077;, &#1085;&#1086; &#1076;&#1074;&#1080;&#1075;&#1072;&#1102;&#1090;&#1089;&#1103; &#1073;&#1099;&#1089;&#1090;&#1088;&#1077;&#1077;.
        </p></div></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e21"></a>&#1048;&#1083;&#1083;&#1102;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080;</h2></div></div></div><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>
                    <span class="emphasis"><em>&#1057;&#1090;&#1072;&#1088;&#1090;</em></span>
                </p><p>
                    </p><div class="mediaobject" align="center"><img src="../../images/1.png" align="middle"></div><p>
                </p></li><li class="listitem"><p>
                    <span class="emphasis"><em>&#1048;&#1075;&#1088;&#1086;&#1074;&#1086;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;</em></span>
                </p><p>
                    </p><div class="mediaobject" align="center"><img src="../../images/2.png" align="middle"></div><p>
                </p></li></ol></div></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e38"></a>&#1044;&#1077;&#1090;&#1072;&#1083;&#1080; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;</h2></div></div></div><p>&#1054;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1085;&#1080;&#1078;&#1077;:</p><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e41"></a>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1082;&#1086;&#1088;&#1072;&#1073;&#1083;&#1103;</h3></div></div></div><p>&#1044;&#1072;&#1085;&#1085;&#1072;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1089;&#1090;&#1072;&#1088;&#1090;&#1077; &#1080; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079; &#1087;&#1088;&#1080; &#1082;&#1088;&#1091;&#1096;&#1077;&#1085;&#1080;&#1080; &#1082;&#1086;&#1088;&#1072;&#1073;&#1083;&#1103;. 
                &#1042; &#1085;&#1077;&#1081; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1087;&#1088;&#1080;&#1089;&#1074;&#1086;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;, &#1091;&#1075;&#1083;&#1072;, &#1084;&#1077;&#1088;&#1094;&#1072;&#1085;&#1080;&#1081; &#1080; &#1090;.&#1087;.</p><pre class="programlisting">
                
    function newShip() {
        return {
            x: canvas.width / 2,
            y: canvas.height / 2,
            r: SHIP_SIZE / 2,
            a: 90 / 180 * Math.PI,
            blinkTime: Math.ceil(SHIP_BLINK_DURATION * FPS),
            blinkNum: Math.ceil(SHIP_INV_DURATION / SHIP_BLINK_DURATION),
            canShoot: true,
            explodeTime: 0,
            lasers: [],
            rot: 0,
            thrusting: false,
            thrust: {
                x: 0,
                y: 0
            }
        }
    }
                
            </pre></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e45"></a>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1072;&#1089;&#1090;&#1077;&#1088;&#1086;&#1080;&#1076;&#1072;</h3></div></div></div><p>&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;&#1072; &#1080;&#1079; &#1089;&#1090;&#1072;&#1088;&#1090;&#1086;&#1074;&#1099;&#1093; &#1072;&#1089;&#1090;&#1077;&#1088;&#1086;&#1080;&#1076;&#1086;&#1074; &#1080; 
                &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1091;&#1085;&#1080;&#1095;&#1090;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1072;&#1089;&#1090;&#1077;&#1088;&#1086;&#1080;&#1076;&#1072;,&#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090;&#1089;&#1103; 
                &#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1076;&#1074;&#1072; &#1073;&#1086;&#1083;&#1077;&#1077; &#1084;&#1077;&#1083;&#1082;&#1080;&#1093; &#1072;&#1089;&#1090;&#1077;&#1088;&#1086;&#1080;&#1076;&#1072;. &#1057;&#1090;&#1072;&#1088;&#1090;&#1086;&#1074;&#1099;&#1077; &#1072;&#1089;&#1090;&#1077;&#1088;&#1086;&#1080;&#1076;&#1099; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1080; &#1085;&#1077; &#1087;&#1086;&#1087;&#1072;&#1076;&#1072;&#1102;&#1090; 
                &#1074; &#1073;&#1091;&#1092;&#1092;&#1077;&#1088;&#1085;&#1091;&#1102; &#1079;&#1086;&#1085;&#1091; &#1082;&#1086;&#1088;&#1072;&#1073;&#1083;&#1103;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1087;&#1088;&#1080; &#1089;&#1090;&#1072;&#1088;&#1090;&#1077; &#1082;&#1086;&#1088;&#1072;&#1073;&#1083;&#1100; &#1074; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;</p><pre class="programlisting">
                
    function newAsteroid(x, y, r) {
        var asteroid = {
            x: x,
            y: y,
            xV: Math.random() * ASTEROIDS_SPEED / FPS * (Math.random() &lt; 0.5 ? 1 : -1),
            yV: Math.random() * ASTEROIDS_SPEED / FPS * (Math.random() &lt; 0.5 ? 1 : -1),
            r: r,
            explodeTime: 0,
            a: Math.random() * Math.PI * 2,
            vertex: Math.floor(Math.random() * (ASTEROIDS_VERTEX + 1) + ASTEROIDS_VERTEX / 2),
            offset: []
        };
        for (var i = 0; i &lt; asteroid.vertex; i++) {
            asteroid.offset.push(Math.random() * ASTEROIDS_JAG * 2 + 1 - ASTEROIDS_JAG);
        }
        return asteroid;
    }
                
            </pre></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e49"></a>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1083;&#1072;&#1079;&#1077;&#1088;&#1072;</h3></div></div></div><p>&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1085;&#1072;&#1078;&#1080;&#1084;&#1072;&#1077;&#1090; &#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091;
                &#1089;&#1090;&#1088;&#1077;&#1083;&#1100;&#1073;&#1099;. &#1050;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1083;&#1072;&#1079;&#1077;&#1088;&#1086;&#1074; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1085;&#1086;</p><pre class="programlisting">
                
    function shootLaser() {
        if (ship.canShoot &amp;&amp; ship.lasers.length &lt; LASER_MAX) {
            ship.lasers.push({
                x: ship.x + 4 / 3 * ship.r * Math.cos(ship.a),
                y: ship.y - 4 / 3 * ship.r * Math.sin(ship.a),
                xv: LASER_SPEED * Math.cos(ship.a) / FPS,
                yv: -LASER_SPEED * Math.sin(ship.a) / FPS,
                dist: 0,
                explodeTime: 0
            });
        }
        ship.canShoot = false;
    }
                
            </pre></div></div></div></body></html>